shambhukumar@shambhukumar-Aspire-A315-21:~/embedded_workspace/stm32f407vg_disc1board/stm32f407vgt6_i2c_testcode$ arm-none-eabi-gdb-py3 build_files/main.elf 
GNU gdb (xPack GNU Arm Embedded GCC x86_64) 13.2.90.20231008-git
Copyright (C) 2023 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "--host=x86_64-pc-linux-gnu --target=arm-none-eabi".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from build_files/main.elf...
(gdb) target remote :4242
Remote debugging using :4242
0x08000320 in i2c1_slave_rx_address () at source/main.c:134
134		while((I2C1->SR1 & (1<<1)) == 0);	//wait until ADDR bit set (sets when @ received)
(gdb) b main
Breakpoint 1 at 0x80003c4: file source/main.c, line 171.
Note: automatically using hardware breakpoints for read-only addresses.
(gdb) c
Continuing.
^C
Program received signal SIGTRAP, Trace/breakpoint trap.
i2c1_slave_rx_address () at source/main.c:134
134		while((I2C1->SR1 & (1<<1)) == 0);	//wait until ADDR bit set (sets when @ received)
(gdb) n
135		dump_reg = I2C1->SR1;	//read SR1 reg to clear ADDR bit
(gdb) n
136		dump_reg = I2C1->SR2;	//read SR2 reg to clear ADDR bit
(gdb) n
main () at source/main.c:184
184			data = i2c1_slave_rx_data();
(gdb) n
185			i2c1_slave_rx_stop();
(gdb) p data 
$1 = 90 'Z'
(gdb) inf
inferior  info      
(gdb) info all-registers 
r0             0x5a                90
r1             0x40005400          1073763328
r2             0x20000000          536870912
r3             0x20000000          536870912
r4             0x2000001c          536870940
r5             0x0                 0
r6             0x0                 0
r7             0x0                 0
r8             0x0                 0
r9             0x0                 0
r10            0x0                 0
r11            0x0                 0
r12            0x0                 0
sp             0x2001fff8          0x2001fff8
lr             0x80003df           134218719
pc             0x80003e2           0x80003e2 <main+30>
xpsr           0x21000000          553648128
msp            0x2001fff8          0x2001fff8
psp            0x0                 0x0
control        0x0                 0 '\000'
faultmask      0x0                 0 '\000'
basepri        0x0                 0 '\000'
primask        0x0                 0 '\000'
s0             0                   (raw 0x00000000)
s1             0                   (raw 0x00000000)
s2             0                   (raw 0x00000000)
s3             0                   (raw 0x00000000)
s4             0                   (raw 0x00000000)
--Type <RET> for more, q to quit, c to continue without paging--c
s5             0                   (raw 0x00000000)
s6             0                   (raw 0x00000000)
s7             0                   (raw 0x00000000)
s8             0                   (raw 0x00000000)
s9             0                   (raw 0x00000000)
s10            0                   (raw 0x00000000)
s11            0                   (raw 0x00000000)
s12            0                   (raw 0x00000000)
s13            0                   (raw 0x00000000)
s14            0                   (raw 0x00000000)
s15            0                   (raw 0x00000000)
s16            0                   (raw 0x00000000)
s17            0                   (raw 0x00000000)
s18            0                   (raw 0x00000000)
s19            0                   (raw 0x00000000)
s20            0                   (raw 0x00000000)
s21            0                   (raw 0x00000000)
s22            0                   (raw 0x00000000)
s23            0                   (raw 0x00000000)
s24            0                   (raw 0x00000000)
s25            0                   (raw 0x00000000)
s26            0                   (raw 0x00000000)
s27            0                   (raw 0x00000000)
s28            0                   (raw 0x00000000)
s29            0                   (raw 0x00000000)
s30            0                   (raw 0x00000000)
s31            0                   (raw 0x00000000)
fpscr          0x0                 0
(gdb) l
180		//eternal loop
181		for(;;)
182		{
183			i2c1_slave_rx_address();
184			data = i2c1_slave_rx_data();
185			i2c1_slave_rx_stop();
186		}
187	
188		return 0;
189	}
(gdb) l
190	
(gdb) bt
#0  main () at source/main.c:185
(gdb) bt
#0  main () at source/main.c:185
(gdb) delete b
bookmark     breakpoints  
(gdb) delete breakpoints 1
(gdb) bt
#0  main () at source/main.c:185
(gdb) l
Line number 191 out of range; source/main.c has 190 lines.
(gdb) b main
Breakpoint 2 at 0x80003c4: file source/main.c, line 171.
(gdb) delete 1
No breakpoint number 1.
(gdb) delete breakpoints 
Delete all breakpoints? (y or n) y
(gdb) break
break        break-range  
(gdb) bt
#0  main () at source/main.c:185
(gdb) b main
Breakpoint 3 at 0x80003c4: file source/main.c, line 171.
(gdb) p z
No symbol "z" in current context.
(gdb) p data 
$2 = 90 'Z'
(gdb) c
Continuing.
^C
Program received signal SIGTRAP, Trace/breakpoint trap.
0x08000322 in i2c1_slave_rx_address () at source/main.c:134
134		while((I2C1->SR1 & (1<<1)) == 0);	//wait until ADDR bit set (sets when @ received)
(gdb) n
135		dump_reg = I2C1->SR1;	//read SR1 reg to clear ADDR bit
(gdb) n
136		dump_reg = I2C1->SR2;	//read SR2 reg to clear ADDR bit
(gdb) n
main () at source/main.c:184
184			data = i2c1_slave_rx_data();
(gdb) re
record              remove-inferiors    return              reverse-next        reverse-step        
refresh             remove-symbol-file  reverse-continue    reverse-nexti       reverse-stepi       
remote              restore             reverse-finish      reverse-search      
(gdb) p
passcount           pipe                print-object        ptype               python              
path                print               printf              pwd                 python-interactive  
(gdb) print 
Display all 170 possibilities? (y or n)
/opt/arm-gnu-toolchain/arm-none-eabi/include/machine/_default_types.h
/opt/arm-gnu-toolchain/arm-none-eabi/include/sys/_stdint.h
ADC_IRQHandler
BusFault_Handler
CAN1_RX0_IRQHandler
CAN1_RX1_IRQHandler
CAN1_SCE_IRQHandler
CAN1_TX_IRQHandler
CAN2_RX0_IRQHandler
CAN2_RX1_IRQHandler
CAN2_SCE_IRQHandler
CAN2_TX_IRQHandler
CRYP_IRQHandler
CopyDataInit
DCMI_IRQHandler
DMA1_Stream0_IRQHandler
DMA1_Stream1_IRQHandler
DMA1_Stream2_IRQHandler
DMA1_Stream3_IRQHandler
DMA1_Stream4_IRQHandler
DMA1_Stream5_IRQHandler
DMA1_Stream6_IRQHandler
DMA1_Stream7_IRQHandler
DMA2_Stream0_IRQHandler
DMA2_Stream1_IRQHandler
DMA2_Stream2_IRQHandler
DMA2_Stream3_IRQHandler
DMA2_Stream4_IRQHandler
DMA2_Stream5_IRQHandler
DMA2_Stream6_IRQHandler
DMA2_Stream7_IRQHandler
DebugMon_Handler
Default_Handler
ETH_IRQHandler
ETH_WKUP_IRQHandler
EXTI0_IRQHandler
EXTI15_10_IRQHandler
EXTI1_IRQHandler
EXTI2_IRQHandler
EXTI3_IRQHandler
EXTI4_IRQHandler
EXTI9_5_IRQHandler
FPU_IRQHandler
FSMC_IRQHandler
FillZerobss
GPIO_TypeDef
HASH_RNG_IRQHandler
HardFault_Handler
I2C1_ER_IRQHandler
I2C1_EV_IRQHandler
I2C2_ER_IRQHandler
I2C2_EV_IRQHandler
I2C3_ER_IRQHandler
I2C3_EV_IRQHandler
I2C_TypeDef
Infinite_Loop
LoopCopyDataInit
LoopFillZerobss
LoopForever
MemManage_Handler
NMI_Handler
OTG_FS_IRQHandler
OTG_FS_WKUP_IRQHandler
OTG_HS_EP1_IN_IRQHandler
OTG_HS_EP1_OUT_IRQHandler
OTG_HS_IRQHandler
OTG_HS_WKUP_IRQHandler
PVD_IRQHandler
PendSV_Handler
RCC_IRQHandler
RCC_TypeDef
RTC_Alarm_IRQHandler
RTC_WKUP_IRQHandler
Reset_Handler
SDIO_IRQHandler
SPI1_IRQHandler
SPI2_IRQHandler
SPI3_IRQHandler
SVC_Handler
SysTick_Handler
TAMP_STAMP_IRQHandler
TIM1_BRK_TIM9_IRQHandler
TIM1_CC_IRQHandler
TIM1_TRG_COM_TIM11_IRQHandler
TIM1_UP_TIM10_IRQHandler
TIM2_IRQHandler
TIM3_IRQHandler
TIM4_IRQHandler
TIM5_IRQHandler
TIM6_DAC_IRQHandler
TIM7_IRQHandler
TIM8_BRK_TIM12_IRQHandler
TIM8_CC_IRQHandler
TIM8_TRG_COM_TIM14_IRQHandler
TIM8_UP_TIM13_IRQHandler
UART4_IRQHandler
UART5_IRQHandler
USART1_IRQHandler
USART2_IRQHandler
USART3_IRQHandler
USART6_IRQHandler
UsageFault_Handler
WWDG_IRQHandler
_Min_Heap_Size
_Min_Stack_Size
__EH_FRAME_BEGIN__
__bss_end__
__bss_start__
__do_global_dtors_aux
__do_global_dtors_aux_fini_array_entry
__frame_dummy_init_array_entry
__init_array_end
__init_array_start
__libc_init_array
__preinit_array_end
__preinit_array_start
__uint16_t
__uint32_t
__uint8_t
_ebss
_edata
_end
_estack
_etext
_fini
_init
_sbss
_sdata
_siccmram
_sidata
char
completed
data
deregister_tm_clones
dump_reg
frame_dummy
g_pfnVectors
i2c1_config
i2c1_disable
i2c1_enable
i2c1_gpio_config
i2c1_master_send_start
i2c1_master_tx_data
i2c1_master_tx_slave_addr
i2c1_master_tx_stop
i2c1_slave_config
i2c1_slave_rx_address
i2c1_slave_rx_data
i2c1_slave_rx_stop
include/stm32f407xx.h
int
long
long double
long long
main
object
register_tm_clones
short
signed char
source/main.c
startup_stm32f407vgtx.s
temp_delay
uint16_t
uint32_t
uint8_t
unsigned char
unsigned int
unsigned long
unsigned long long
unsigned short
(gdb) print 
$3 = 90 'Z'
(gdb) 
$4 = 90 'Z'
(gdb) 
$5 = 90 'Z'
(gdb) 
$6 = 90 'Z'
(gdb) 
$7 = 90 'Z'
(gdb) 
$8 = 90 'Z'
(gdb) 
$9 = 90 'Z'
(gdb) 
$10 = 90 'Z'
(gdb) 
$11 = 90 'Z'
(gdb) 
$12 = 90 'Z'
(gdb) 
$13 = 90 'Z'
(gdb) 
$14 = 90 'Z'
(gdb) 
$15 = 90 'Z'
(gdb) 
$16 = 90 'Z'
(gdb) 
$17 = 90 'Z'
(gdb) 
$18 = 90 'Z'
(gdb) 
$19 = 90 'Z'
(gdb) 
$20 = 90 'Z'
(gdb) 
$21 = 90 'Z'
(gdb) 
$22 = 90 'Z'
(gdb) 
$23 = 90 'Z'
(gdb) 
$24 = 90 'Z'
(gdb) 
$25 = 90 'Z'
(gdb) 
$26 = 90 'Z'
(gdb) 
$27 = 90 'Z'
(gdb) 
$28 = 90 'Z'
(gdb) 
$29 = 90 'Z'
(gdb) 
$30 = 90 'Z'
(gdb) 
$31 = 90 'Z'
(gdb) 
$32 = 90 'Z'
(gdb) p i
i2c1_config                i2c1_master_send_start     i2c1_slave_config          include/stm32f407xx.h
i2c1_disable               i2c1_master_tx_data        i2c1_slave_rx_address      int
i2c1_enable                i2c1_master_tx_slave_addr  i2c1_slave_rx_data         
i2c1_gpio_config           i2c1_master_tx_stop        i2c1_slave_rx_stop         
(gdb) p i2c1_enable 
$33 = {void (void)} 0x8000228 <i2c1_enable>
(gdb) p I2C1->DR
No symbol "I2C1" in current context.
(gdb) p 0x40005410
$34 = 1073763344
(gdb) p @0x40005410
A syntax error in expression, near `0x40005410'.
(gdb) 0x40005410
Undefined command: "0x40005410".  Try "help".
(gdb) x 0x40005410
0x40005410:	0x0000005a
(gdb) s 0x40005410
^C^C^C^C^C^CThe target is not responding to GDB commands.
Stop debugging it? (y or n) Quit
(gdb) Quit
(gdb) Quit
(gdb) Quit
(gdb) Quit
(gdb) Quit
(gdb) x 0x40005410
0x40005410:	0x0000005a
(gdb) re
record              remove-inferiors    return              reverse-next        reverse-step        
refresh             remove-symbol-file  reverse-continue    reverse-nexti       reverse-stepi       
remote              restore             reverse-finish      reverse-search      
(gdb) record 
btrace                 full                   goto                   save                   
delete                 function-call-history  instruction-history    stop                   
(gdb) record full 
Process record: the current architecture doesn't support record function.
(gdb) r
rbreak              remote              return              reverse-nexti       rni                 
rc                  remove-inferiors    reverse-continue    reverse-search      rsi                 
record              remove-symbol-file  reverse-finish      reverse-step        run                 
refresh             restore             reverse-next        reverse-stepi       rwatch              
(gdb) watch data 
Hardware watchpoint 4: data
(gdb) w
Missing arguments.
(gdb) watch 
Argument required (expression to compute).
(gdb) p
$35 = 1073763344
(gdb) x 0x40005414
0x40005414:	0x00000012
(gdb) x 0x40005418
0x40005418:	0x00000002
(gdb) x 0x4000541C
0x4000541c:	0x00000050
(gdb) x 0x4000541E
0x4000541e:	0x00110000
(gdb) x 0x40005420
0x40005420:	0x00000011
(gdb) x 0x40005410
0x40005410:	0x0000005a
(gdb) x 0x4000540C
0x4000540c:	0x00000000
(gdb) x 0x40005408
0x40005408:	0x00004010
(gdb) x 0x40005404
0x40005404:	0x00000010
(gdb) x 0x40005400
0x40005400:	0x00000401
(gdb) c
Continuing.
^C
Program received signal SIGTRAP, Trace/breakpoint trap.
i2c1_slave_rx_data () at source/main.c:144
144		while((I2C1->SR1 & (1<<6)) == 0);	//wait until RxNE bit sets, data shift reg empty
(gdb) s
^C^C^C^CInterrupted while waiting for the program.
Give up waiting? (y or n) Quit
(gdb) n
^C^C^C^C^C^C^C^C^C^CThe target is not responding to GDB commands.
Stop debugging it? (y or n) Quit
(gdb) Quit
(gdb) Quit
(gdb) s
save           select-frame   shell          signal         start          stepi          strace         
search         set            show           skip           starti         stepping       symbol-file    
section        sharedlibrary  si             source         step           stop           
(gdb) save 
breakpoints  gdb-index    tracepoints  
(gdb) t
taas       task       tcatch     teval      tfind      thread     trace      tstart     tstop      tui        
target     tbreak     tdump      tfaas      thbreak    tp         tsave      tstatus    tty        tvariable  
(gdb) trace 
Display all 135 possibilities? (y or n)
(gdb) tsave 
Display all 165 possibilities? (y or n)
(gdb) tty
(gdb) tty 
.vscode/                 STM32F407VGTX_RAM.ld     include/                 setupI2C.md              startup_stm32f407vgtx.s
STM32F407VGTX_FLASH.ld   build_files/             makefile                 source/                  
(gdb) tty 
.vscode/                 STM32F407VGTX_RAM.ld     include/                 setupI2C.md              startup_stm32f407vgtx.s
STM32F407VGTX_FLASH.ld   build_files/             makefile                 source/                  
(gdb) thread 
apply  find   name   
(gdb) thread 
[Current thread is 1 (Thread <main>)]
(gdb) tvariable 
Display all 170 possibilities? (y or n)
/opt/arm-gnu-toolchain/arm-none-eabi/include/machine/_default_types.h
/opt/arm-gnu-toolchain/arm-none-eabi/include/sys/_stdint.h
ADC_IRQHandler
BusFault_Handler
CAN1_RX0_IRQHandler
CAN1_RX1_IRQHandler
CAN1_SCE_IRQHandler
CAN1_TX_IRQHandler
CAN2_RX0_IRQHandler
CAN2_RX1_IRQHandler
CAN2_SCE_IRQHandler
CAN2_TX_IRQHandler
CRYP_IRQHandler
CopyDataInit
DCMI_IRQHandler
DMA1_Stream0_IRQHandler
DMA1_Stream1_IRQHandler
DMA1_Stream2_IRQHandler
DMA1_Stream3_IRQHandler
DMA1_Stream4_IRQHandler
DMA1_Stream5_IRQHandler
DMA1_Stream6_IRQHandler
DMA1_Stream7_IRQHandler
DMA2_Stream0_IRQHandler
DMA2_Stream1_IRQHandler
DMA2_Stream2_IRQHandler
DMA2_Stream3_IRQHandler
DMA2_Stream4_IRQHandler
DMA2_Stream5_IRQHandler
DMA2_Stream6_IRQHandler
DMA2_Stream7_IRQHandler
DebugMon_Handler
Default_Handler
ETH_IRQHandler
ETH_WKUP_IRQHandler
EXTI0_IRQHandler
EXTI15_10_IRQHandler
EXTI1_IRQHandler
EXTI2_IRQHandler
EXTI3_IRQHandler
EXTI4_IRQHandler
EXTI9_5_IRQHandler
FPU_IRQHandler
FSMC_IRQHandler
FillZerobss
GPIO_TypeDef
HASH_RNG_IRQHandler
HardFault_Handler
I2C1_ER_IRQHandler
I2C1_EV_IRQHandler
I2C2_ER_IRQHandler
I2C2_EV_IRQHandler
I2C3_ER_IRQHandler
I2C3_EV_IRQHandler
I2C_TypeDef
Infinite_Loop
LoopCopyDataInit
LoopFillZerobss
LoopForever
MemManage_Handler
NMI_Handler
OTG_FS_IRQHandler
OTG_FS_WKUP_IRQHandler
OTG_HS_EP1_IN_IRQHandler
OTG_HS_EP1_OUT_IRQHandler
OTG_HS_IRQHandler
OTG_HS_WKUP_IRQHandler
PVD_IRQHandler
PendSV_Handler
RCC_IRQHandler
RCC_TypeDef
RTC_Alarm_IRQHandler
RTC_WKUP_IRQHandler
Reset_Handler
SDIO_IRQHandler
SPI1_IRQHandler
SPI2_IRQHandler
SPI3_IRQHandler
SVC_Handler
SysTick_Handler
TAMP_STAMP_IRQHandler
TIM1_BRK_TIM9_IRQHandler
TIM1_CC_IRQHandler
TIM1_TRG_COM_TIM11_IRQHandler
TIM1_UP_TIM10_IRQHandler
TIM2_IRQHandler
TIM3_IRQHandler
TIM4_IRQHandler
TIM5_IRQHandler
TIM6_DAC_IRQHandler
TIM7_IRQHandler
TIM8_BRK_TIM12_IRQHandler
TIM8_CC_IRQHandler
TIM8_TRG_COM_TIM14_IRQHandler
TIM8_UP_TIM13_IRQHandler
UART4_IRQHandler
UART5_IRQHandler
USART1_IRQHandler
USART2_IRQHandler
USART3_IRQHandler
USART6_IRQHandler
UsageFault_Handler
WWDG_IRQHandler
_Min_Heap_Size
_Min_Stack_Size
__EH_FRAME_BEGIN__
__bss_end__
__bss_start__
__do_global_dtors_aux
__do_global_dtors_aux_fini_array_entry
__frame_dummy_init_array_entry
__init_array_end
__init_array_start
__libc_init_array
__preinit_array_end
__preinit_array_start
__uint16_t
__uint32_t
__uint8_t
_ebss
_edata
_end
_estack
_etext
_fini
_init
_sbss
_sdata
_siccmram
_sidata
char
completed
data
deregister_tm_clones
dump_reg
frame_dummy
g_pfnVectors
i2c1_config
i2c1_disable
i2c1_enable
i2c1_gpio_config
i2c1_master_send_start
i2c1_master_tx_data
i2c1_master_tx_slave_addr
i2c1_master_tx_stop
i2c1_slave_config
i2c1_slave_rx_address
i2c1_slave_rx_data
i2c1_slave_rx_stop
include/stm32f407xx.h
int
long
long double
long long
main
object
register_tm_clones
short
signed char
source/main.c
startup_stm32f407vgtx.s
temp_delay
uint16_t
uint32_t
uint8_t
unsigned char
unsigned int
unsigned long
unsigned long long
unsigned short
(gdb) tvariable 
Argument required (Syntax is $NAME [ = EXPR ]).
(gdb) 
Argument required (Syntax is $NAME [ = EXPR ]).
(gdb) tvariable s
short                    signed char              source/main.c            startup_stm32f407vgtx.s  stm32f407xx.h
(gdb) tvariable d
data                  deregister_tm_clones  dump_reg              
(gdb) tvariable d
data                  deregister_tm_clones  dump_reg              
(gdb) tvariable data 
Name of trace variable should start with '$'
(gdb) tvariable $data 
Trace state variable $data created, with initial value 0.
(gdb) p
passcount           pipe                print-object        ptype               python              
path                print               printf              pwd                 python-interactive  
(gdb) quit 
A debugging session is active.

	Inferior 1 [Remote target] will be killed.

Quit anyway? (y or n) y

